main/src/Documents/РасходДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Document>
		<Properties>
			<Name>РасходДенежныхСредств</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ПланируемыеОстаткиДенежныхСредств</xr:Item>
				<xr:Item>AccumulationRegister.ДенежныеСредства</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидРасхода</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Назначение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>500</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПовторяемоеСобытие</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УИДПовторяемыхСобытий</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоДнейДляПовторения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияПовторяемыхСобытий</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидПовторяемогоСобытий</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыПовторяемыхСобытий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

main/src/AccumulationRegisters/ДенежныеСредства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>ДенежныеСредства</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

main/src/AccumulationRegisters/ПланируемыеОстаткиДенежныхСредств.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<AccumulationRegister>
		<Properties>
			<Name>ПланируемыеОстаткиДенежныхСредств</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

main/src/Enums/ВидыРасходов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ВидыРасходов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Планируемый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Фактический</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

main/src/Enums/ВидыПовторяемыхСобытий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.7">
	<Enum>
		<Properties>
			<Name>ВидыПовторяемыхСобытий</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПовторятьЧерезНесколькоДней</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПовторятьВКонкретнуюДату</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

main/src/Documents/РасходДенежныхСредств/Ext/ObjectModule.bsl
#Область ОбработчикиСобытийОбъекта

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	ДополнительныеСвойства.Вставить("СуммаДоИзменения", Ссылка.Сумма);
	ДополнительныеСвойства.Вставить("ВидРасходаДоИзменения", Ссылка.ВидРасхода);
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	ПроведениеСервер.ПодготовитьНаборыЗаписейКПроведению(ЭтотОбъект);
	
	Если ВидРасхода = Перечисления.ВидыРасходов.Фактический Тогда
		
		СформироватьДвиженияПоРегиструДенежныеСредства();
		УчетДенежныхСредствСервер.СформироватьРасходПоРегиструОстатокЛимитаДенежныхСредств(Сумма);
	
	ИначеЕсли ВидРасхода = Перечисления.ВидыРасходов.Планируемый Тогда
		
		СформироватьДвиженияПоРегиструПланируемыеОстаткиДенежныхСредств();
		
		СоздатьПовторяющиесяСобытия();
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	
	Если ДополнительныеСвойства.СуммаДоИзменения <> 0 Тогда
		
		ПроведениеСервер.ПодготовитьНаборыЗаписейКОтменеПроведения(ЭтотОбъект);
		
		Если ДополнительныеСвойства.ВидРасходаДоИзменения = Перечисления.ВидыРасходов.Фактический Тогда
			УчетДенежныхСредствСервер.СформироватьПриходПоРегиструОстатокЛимитаДенежныхСредств(ДополнительныеСвойства.СуммаДоИзменения);
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	Если ВидРасхода = Перечисления.ВидыРасходов.Фактический Тогда
		УчетДенежныхСредствСервер.СформироватьПриходПоРегиструОстатокЛимитаДенежныхСредств(Сумма);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыФункции

Процедура СформироватьДвиженияПоРегиструДенежныеСредства()
	
	Движения.ДенежныеСредства.Записывать = Истина;
	
	Движение = Движения.ДенежныеСредства.ДобавитьРасход();
	Движение.Период = Дата;
	Движение.Сумма = Сумма;

КонецПроцедуры

Процедура СформироватьДвиженияПоРегиструПланируемыеОстаткиДенежныхСредств()
	
	Движения.ПланируемыеОстаткиДенежныхСредств.Записывать = Истина;
	
	Движение = Движения.ПланируемыеОстаткиДенежныхСредств.Добавить();
	Движение.Период = Дата;
	Движение.Сумма = Сумма;
	
КонецПроцедуры

Процедура СоздатьПовторяющиесяСобытия()
	
	Если ПовторяемоеСобытие Тогда
		
		Документы.РасходДенежныхСредств.УдалитьВсеПовторяющиеСобытияПоДанномуОснованию(УИДПовторяемыхСобытий, Ссылка);
		
		Если ВидПовторяемогоСобытий = Перечисления.ВидыПовторяемыхСобытий.ПовторятьЧерезНесколькоДней И КоличествоДнейДляПовторения <> 0 Тогда
			
			ДатаСозданияНовогоПовторяемогоСобытия = ОбщегоНазначенияСервер.ДобавитьКДате(Дата, КоличествоДнейДляПовторения, "ДЕНЬ");
			
			Пока ДатаСозданияНовогоПовторяемогоСобытия < ДатаОкончанияПовторяемыхСобытий Цикл
				
				НовыйДокумент = СоздатьДокументПоПовторяющемусяСобытию(ДатаСозданияНовогоПовторяемогоСобытия);
				
				ДатаСозданияНовогоПовторяемогоСобытия = ОбщегоНазначенияСервер.ДобавитьКДате(
					НовыйДокумент.Дата, 
					КоличествоДнейДляПовторения,
					"ДЕНЬ");
				
			КонецЦикла;
			
		ИначеЕсли ВидПовторяемогоСобытий = Перечисления.ВидыПовторяемыхСобытий.ПовторятьВКонкретнуюДату Тогда
			
			ДатаСозданияНовогоПовторяемогоСобытия = ОбщегоНазначенияСервер.ДобавитьКДате(Дата, 1, "МЕСЯЦ");
			Если КонецДня(Дата) = КонецМесяца(Дата) Тогда
				ДатаСозданияНовогоПовторяемогоСобытия = КонецМесяца(ДатаСозданияНовогоПовторяемогоСобытия);	
			КонецЕсли;
			
			Пока ДатаСозданияНовогоПовторяемогоСобытия < ДатаОкончанияПовторяемыхСобытий Цикл
				
				НовыйДокумент = СоздатьДокументПоПовторяющемусяСобытию(ДатаСозданияНовогоПовторяемогоСобытия);
				
				ДатаСозданияНовогоПовторяемогоСобытия = ОбщегоНазначенияСервер.ДобавитьКДате(НовыйДокумент.Дата, 1, "МЕСЯЦ");
				Если КонецДня(Дата) = КонецМесяца(Дата) Тогда
					ДатаСозданияНовогоПовторяемогоСобытия = КонецМесяца(ДатаСозданияНовогоПовторяемогоСобытия);	
				КонецЕсли;
				
			КонецЦикла;
				
		КонецЕсли;		
		
	КонецЕсли;
	
КонецПроцедуры

Функция СоздатьДокументПоПовторяющемусяСобытию(ДатаСозданияНовогоПовторяемогоСобытия)
	
	НовыйДокумент = Документы.РасходДенежныхСредств.СоздатьДокумент();
	НовыйДокумент.Дата = ДатаСозданияНовогоПовторяемогоСобытия;
	НовыйДокумент.ВидРасхода = Перечисления.ВидыРасходов.Планируемый;
	НовыйДокумент.Сумма = Сумма;
	НовыйДокумент.Назначение = Назначение;
	НовыйДокумент.УИДПовторяемыхСобытий = УИДПовторяемыхСобытий;
	НовыйДокумент.Записать(РежимЗаписиДокумента.Проведение);
	
	Возврат НовыйДокумент;

КонецФункции

#КонецОбласти
